2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/KUC070-Reisdocumenten_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>${DataSource Values#Header_EEE1}</soapenv:Header>
	<soapenv:Body>
		<brp:bhg_rsdRegistreerReisdocument xmlns:brp="http://www.bzk.nl/brp/brp0200">
			<brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
				<brp:zendendePartij>${DataSource Values#zendendePartij_zsR1}</brp:zendendePartij>
				<brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsR1}</brp:zendendeSysteem>
				<brp:referentienummer>${DataSource Values#referentienummer_sRB1}</brp:referentienummer>
				<brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
			</brp:stuurgegevens>
			<brp:parameters brp:communicatieID="${DataSource Values#com_id.parameters1}">
				<brp:verwerkingswijze>${DataSource Values#verwerkingswijze_pRB1}</brp:verwerkingswijze>
			</brp:parameters>
			<brp:verkrijgingReisdocument
                                      brp:communicatieID="${DataSource Values#com_id.verkrijgingReisdocument1}"
                                      brp:objecttype="AdministratieveHandeling">
				<brp:partijCode>${DataSource Values#partijCode_rRB1}</brp:partijCode>
				<brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rRB1}</brp:toelichtingOntlening>
				<brp:gedeblokkeerdeMeldingen>
					<brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding1}"
                                          brp:referentieID="${DataSource Values#|ref_id.gedeblokkeerdeMelding1|}"
                                          brp:objecttype="GedeblokkeerdeMelding">
						<brp:regelCode>${DataSource Values#regelCode_ggr1}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggr1}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
					<brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding10}"
                                          brp:referentieID="${DataSource Values#|ref_id.gedeblokkeerdeMelding10|}"
                                          brp:objecttype="GedeblokkeerdeMelding">
						<brp:regelCode>${DataSource Values#regelCode_ggr10}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggr10}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
				</brp:gedeblokkeerdeMeldingen>
				<brp:bronnen>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron1}">
						<brp:document brp:communicatieID="Document1"
								 brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbr1}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbr1}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbr1}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbr1}</brp:partijCode>
						</brp:document>
					</brp:bron>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron10}">
						<brp:document brp:communicatieID="Document2"
								 brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbr10}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbr10}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbr10}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbr10}</brp:partijCode>
						</brp:document>
					</brp:bron>
				</brp:bronnen>
				<brp:acties>
					<brp:registratieReisdocument brp:communicatieID="${DataSource Values#com_id.verkrijgingReisdocument2}"
                                            brp:objecttype="Actie">
						<brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rar1}</brp:datumAanvangGeldigheid>
						<brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_rar1}</brp:datumEindeGeldigheid>
						<brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument1"
                                   brp:referentieID="${DataSource Values#refid.brondocument2}"
                                   brp:objecttype="ActieBron">
							</brp:bron>
						</brp:bronnen>
						<brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon1}"
                               brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#|objectid.persoon1|}">
							<brp:reisdocumenten>
								<brp:reisdocument brp:communicatieID="${DataSource Values#com_id.reisdocument1}"
                                          brp:objecttype="PersoonReisdocument">
									<brp:soortCode>${DataSource Values#soortCode_rrp1}</brp:soortCode>
									<brp:nummer>${DataSource Values#nummer_rrp1}</brp:nummer>
									<brp:autoriteitVanAfgifte>${DataSource Values#autoriteitVanAfgifte_rrp1}</brp:autoriteitVanAfgifte>
									<brp:datumIngangDocument>${DataSource Values#datumIngangDocument_rrp1}</brp:datumIngangDocument>
									<brp:datumEindeDocument>${DataSource Values#datumEindeDocument_rrp1}</brp:datumEindeDocument>
									<brp:datumUitgifte>${DataSource Values#datumUitgifte_rrp1}</brp:datumUitgifte>
								</brp:reisdocument>
							</brp:reisdocumenten>
						</brp:persoon>
					</brp:registratieReisdocument>
				</brp:acties>
			</brp:verkrijgingReisdocument>
			<brp:onttrekkingReisdocument
                                      brp:communicatieID="${DataSource Values#com_id.onttrekkingReisdocument1}"
                                      brp:objecttype="AdministratieveHandeling">
				<brp:partijCode>${DataSource Values#partijCode_oRB1}</brp:partijCode>
				<brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_oRB1}</brp:toelichtingOntlening>
				<brp:gedeblokkeerdeMeldingen>
					<brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding2}"
                                          brp:referentieID="${DataSource Values#|ref_id.gedeblokkeerdeMelding2|}"
                                          brp:objecttype="GedeblokkeerdeMelding">
						<brp:regelCode>${DataSource Values#regelCode_ggo1}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggo1}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
				</brp:gedeblokkeerdeMeldingen>
				<brp:bronnen>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron3}">
						<brp:document brp:communicatieID="Document3"
								 brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbo3}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbo3}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbo3}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbo3}</brp:partijCode>
						</brp:document>
					</brp:bron>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron31}">
						<brp:document brp:communicatieID="Document4"
								 brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbo31}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbo31}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbo31}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbo31}</brp:partijCode>
						</brp:document>
					</brp:bron>
				</brp:bronnen>
				<brp:acties>
					<brp:registratieReisdocument brp:communicatieID="${DataSource Values#com_id.verkrijgingReisdocument3}"
                                            brp:objecttype="Actie">
						<brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rao1}</brp:datumAanvangGeldigheid>
						<brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_rao1}</brp:datumEindeGeldigheid>
						<brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument4"
                                   brp:referentieID="${DataSource Values#refid.brondocument4}"
                                   brp:objecttype="ActieBron">
							</brp:bron>
						</brp:bronnen>
						<brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon2}"
                               brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#|objectid.persoon2|}">
							<brp:reisdocumenten>
								<brp:reisdocument brp:communicatieID="${DataSource Values#com_id.reisdocument2}"
                                          brp:objecttype="PersoonReisdocument"
                                          brp:objectSleutel="${DataSource Values#objectid.reisdocument2}">
									<brp:datumInhoudingVermissing>${DataSource Values#datumInhoudingVermissing_rrp1}</brp:datumInhoudingVermissing>
									<brp:aanduidingInhoudingVermissingCode>${DataSource Values#aanduidingInhoudingVermissingCode_rrp1}</brp:aanduidingInhoudingVermissingCode>
								</brp:reisdocument>
							</brp:reisdocumenten>
						</brp:persoon>
					</brp:registratieReisdocument>
				</brp:acties>
			</brp:onttrekkingReisdocument>
			<brp:signaleringReisdocument
                                                  brp:communicatieID="${DataSource Values#com_id.belemmeringVerstrekkingReisdo1}"
                                                  brp:objecttype="AdministratieveHandeling">
				<brp:partijCode>${DataSource Values#partijCode_bRB1}</brp:partijCode>
				<brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_bRB1}</brp:toelichtingOntlening>
				<brp:gedeblokkeerdeMeldingen>
					<brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding3}"
                                          brp:referentieID="${DataSource Values#ref_id.gedeblokkeerdeMelding3}"
                                          brp:objecttype="GedeblokkeerdeMelding">
						<brp:regelCode>${DataSource Values#regelCode_ggb1}</brp:regelCode>
						<brp:elementNaam>${DataSource Values#elementNaam_ggb1}</brp:elementNaam>
					</brp:gedeblokkeerdeMelding>
				</brp:gedeblokkeerdeMeldingen>
				<brp:bronnen>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron5}">
						<brp:document brp:communicatieID="Document5"
								 brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbb5}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbb5}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbb5}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbb5}</brp:partijCode>
						</brp:document>
					</brp:bron>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron51}">
						<brp:document brp:communicatieID="Document6}"
								 brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbb51}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbb51}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbb51}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbb51}</brp:partijCode>
						</brp:document>
					</brp:bron>
				</brp:bronnen>
				<brp:acties>
					<brp:registratieSignaleringReisdocument brp:communicatieID="${DataSource Values#com_id.registratieBelemmeringVerstre1}"
                                                                   brp:objecttype="Actie">
						<brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rab1}</brp:datumAanvangGeldigheid>
						<brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_rab1}</brp:datumEindeGeldigheid>
						<brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument6"
                                   brp:referentieID="${DataSource Values#refid.brondocument6}"
                                   brp:objecttype="ActieBron">
							</brp:bron>
						</brp:bronnen>
						<brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon3}"
                               brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#|objectid.persoon3|}">
							<brp:indicaties>
								<brp:signaleringMetBetrekkingTotVerstrekkenReisdocument brp:communicatieID="${DataSource Values#com_id.belemmeringVerstrekkingReisdo2}"
                                                                 brp:objecttype="PersoonIndicatie">
									<brp:waarde>${DataSource Values#waarde_bip1}</brp:waarde>
								</brp:signaleringMetBetrekkingTotVerstrekkenReisdocument>
							</brp:indicaties>
						</brp:persoon>
					</brp:registratieSignaleringReisdocument>
				</brp:acties>
			</brp:signaleringReisdocument>
		</brp:bhg_rsdRegistreerReisdocument>
	</soapenv:Body>
</soapenv:Envelope>
